RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/include/ip/cyip_srss_v3.h
/***************************************************************************//**
* \file cyip_srss_v3.h
*
* \brief
* SRSS IP definitions
*
********************************************************************************
* \copyright
* (c) (2016-2022), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#ifndef _CYIP_SRSS_V3_H_
#define _CYIP_SRSS_V3_H_

#include "cyip_headers.h"

/*******************************************************************************
*                                     SRSS
*******************************************************************************/

#define CSV_HF_CSV_SECTION_SIZE                 0x00000010UL
#define CSV_HF_SECTION_SIZE                     0x00000100UL
#define CSV_REF_CSV_SECTION_SIZE                0x00000010UL
#define CSV_REF_SECTION_SIZE                    0x00000010UL
#define CSV_LF_CSV_SECTION_SIZE                 0x00000010UL
#define CSV_LF_SECTION_SIZE                     0x00000010UL
#define CSV_ILO_CSV_SECTION_SIZE                0x00000010UL
#define CSV_ILO_SECTION_SIZE                    0x00000010UL
#define CLK_PLL400M_SECTION_SIZE                0x00000010UL
#define MCWDT_CTR_SECTION_SIZE                  0x00000020UL
#define MCWDT_SECTION_SIZE                      0x00000100UL
#define WDT_SECTION_SIZE                        0x00000080UL
#define SRSS_SECTION_SIZE                       0x00010000UL

/**
  * \brief Active domain Clock Supervisor (CSV) registers (CSV_HF_CSV)
  */
typedef struct {
  __IOM uint32_t REF_CTL;                       /*!< 0x00000000 Clock Supervision Reference Control */
  __IOM uint32_t REF_LIMIT;                     /*!< 0x00000004 Clock Supervision Reference Limits */
  __IOM uint32_t MON_CTL;                       /*!< 0x00000008 Clock Supervision Monitor Control */
   __IM uint32_t RESERVED;
} CSV_HF_CSV_Type;                              /*!< Size = 16 (0x10) */

/**
  * \brief Clock Supervisor (CSV) registers for Root clocks (CSV_HF)
  */
typedef struct {
        CSV_HF_CSV_Type CSV[16];                /*!< 0x00000000 Active domain Clock Supervisor (CSV) registers */
} CSV_HF_Type;                                  /*!< Size = 256 (0x100) */

/**
  * \brief Active domain Clock Supervisor (CSV) registers for CSV Reference clock (CSV_REF_CSV)
  */
typedef struct {
  __IOM uint32_t REF_CTL;                       /*!< 0x00000000 Clock Supervision Reference Control */
  __IOM uint32_t REF_LIMIT;                     /*!< 0x00000004 Clock Supervision Reference Limits */
  __IOM uint32_t MON_CTL;                       /*!< 0x00000008 Clock Supervision Monitor Control */
   __IM uint32_t RESERVED;
} CSV_REF_CSV_Type;                             /*!< Size = 16 (0x10) */

/**
  * \brief CSV registers for the CSV Reference clock (CSV_REF)
  */
typedef struct {
        CSV_REF_CSV_Type CSV;                   /*!< 0x00000000 Active domain Clock Supervisor (CSV) registers for CSV
                                                                Reference clock */
} CSV_REF_Type;                                 /*!< Size = 16 (0x10) */

/**
  * \brief LF clock Clock Supervisor registers (CSV_LF_CSV)
  */
typedef struct {
  __IOM uint32_t REF_CTL;                       /*!< 0x00000000 Clock Supervision Reference Control */
  __IOM uint32_t REF_LIMIT;                     /*!< 0x00000004 Clock Supervision Reference Limits */
  __IOM uint32_t MON_CTL;                       /*!< 0x00000008 Clock Supervision Monitor Control */
   __IM uint32_t RESERVED;
} CSV_LF_CSV_Type;                              /*!< Size = 16 (0x10) */

/**
  * \brief CSV registers for LF clock (CSV_LF)
  */
typedef struct {
        CSV_LF_CSV_Type CSV;                    /*!< 0x00000000 LF clock Clock Supervisor registers */
} CSV_LF_Type;                                  /*!< Size = 16 (0x10) */

/**
  * \brief ILO0 clock DeepSleep domain Clock Supervisor registers (CSV_ILO_CSV)
  */
typedef struct {
  __IOM uint32_t REF_CTL;                       /*!< 0x00000000 Clock Supervision Reference Control */
  __IOM uint32_t REF_LIMIT;                     /*!< 0x00000004 Clock Supervision Reference Limits */
  __IOM uint32_t MON_CTL;                       /*!< 0x00000008 Clock Supervision Monitor Control */
   __IM uint32_t RESERVED;
} CSV_ILO_CSV_Type;                             /*!< Size = 16 (0x10) */

/**
  * \brief CSV registers for HVILO clock (CSV_ILO)
  */
typedef struct {
        CSV_ILO_CSV_Type CSV;                   /*!< 0x00000000 ILO0 clock DeepSleep domain Clock Supervisor registers */
} CSV_ILO_Type;                                 /*!< Size = 16 (0x10) */

/**
  * \brief 400MHz PLL Configuration Register (CLK_PLL400M)
  */
typedef struct {
  __IOM uint32_t CONFIG;                        /*!< 0x00000000 400MHz PLL Configuration Register */
  __IOM uint32_t CONFIG2;                       /*!< 0x00000004 400MHz PLL Configuration Register 2 */
  __IOM uint32_t CONFIG3;                       /*!< 0x00000008 400MHz PLL Configuration Register 3 */
  __IOM uint32_t STATUS;                        /*!< 0x0000000C 400MHz PLL Status Register */
} CLK_PLL400M_Type;                             /*!< Size = 16 (0x10) */

/**
  * \brief MCWDT Configuration for Subcounter 0 and 1 (MCWDT_CTR)
  */
typedef struct {
  __IOM uint32_t CTL;                           /*!< 0x00000000 MCWDT Subcounter Control Register */
  __IOM uint32_t LOWER_LIMIT;                   /*!< 0x00000004 MCWDT Subcounter Lower Limit Register */
  __IOM uint32_t UPPER_LIMIT;                   /*!< 0x00000008 MCWDT Subcounter Upper Limit Register */
  __IOM uint32_t WARN_LIMIT;                    /*!< 0x0000000C MCWDT Subcounter Warn Limit Register */
  __IOM uint32_t CONFIG;                        /*!< 0x00000010 MCWDT Subcounter Configuration Register */
  __IOM uint32_t CNT;                           /*!< 0x00000014 MCWDT Subcounter Count Register */
   __IM uint32_t RESERVED[2];
} MCWDT_CTR_Type;                               /*!< Size = 32 (0x20) */

/**
  * \brief Multi-Counter Watchdog Timer (MCWDT)
  */
typedef struct {
        MCWDT_CTR_Type CTR[2];                  /*!< 0x00000000 MCWDT Configuration for Subcounter 0 and 1 */
  __IOM uint32_t CPU_SELECT;                    /*!< 0x00000040 MCWDT CPU selection register */
   __IM uint32_t RESERVED[15];
  __IOM uint32_t CTR2_CTL;                      /*!< 0x00000080 MCWDT Subcounter 2 Control register */
  __IOM uint32_t CTR2_CONFIG;                   /*!< 0x00000084 MCWDT Subcounter 2 Configuration register */
  __IOM uint32_t CTR2_CNT;                      /*!< 0x00000088 MCWDT Subcounter 2 Count Register */
   __IM uint32_t RESERVED1;
  __IOM uint32_t LOCK;                          /*!< 0x00000090 MCWDT Lock Register */
  __IOM uint32_t SERVICE;                       /*!< 0x00000094 MCWDT Service Register */
   __IM uint32_t RESERVED2[2];
  __IOM uint32_t INTR;                          /*!< 0x000000A0 MCWDT Interrupt Register */
  __IOM uint32_t INTR_SET;                      /*!< 0x000000A4 MCWDT Interrupt Set Register */
  __IOM uint32_t INTR_MASK;                     /*!< 0x000000A8 MCWDT Interrupt Mask Register */
   __IM uint32_t INTR_MASKED;                   /*!< 0x000000AC MCWDT Interrupt Masked Register */
   __IM uint32_t RESERVED3[20];
} MCWDT_Type;                                   /*!< Size = 256 (0x100) */

/**
  * \brief Watchdog Timer (WDT)
  */
typedef struct {
  __IOM uint32_t CTL;                           /*!< 0x00000000 WDT Control Register */
  __IOM uint32_t LOWER_LIMIT;                   /*!< 0x00000004 WDT Lower Limit Register */
  __IOM uint32_t UPPER_LIMIT;                   /*!< 0x00000008 WDT Upper Limit Register */
  __IOM uint32_t WARN_LIMIT;                    /*!< 0x0000000C WDT Warn Limit Register */
  __IOM uint32_t CONFIG;                        /*!< 0x00000010 WDT Configuration Register */
  __IOM uint32_t CNT;                           /*!< 0x00000014 WDT Count Register */
   __IM uint32_t RESERVED[10];
  __IOM uint32_t LOCK;                          /*!< 0x00000040 WDT Lock register */
  __IOM uint32_t SERVICE;                       /*!< 0x00000044 WDT Service register */
   __IM uint32_t RESERVED1[2];
  __IOM uint32_t INTR;                          /*!< 0x00000050 WDT Interrupt Register */
  __IOM uint32_t INTR_SET;                      /*!< 0x00000054 WDT Interrupt Set Register */
  __IOM uint32_t INTR_MASK;                     /*!< 0x00000058 WDT Interrupt Mask Register */
   __IM uint32_t INTR_MASKED;                   /*!< 0x0000005C WDT Interrupt Masked Register */
   __IM uint32_t RESERVED2[8];
} WDT_Type;                                     /*!< Size = 128 (0x80) */

/**
  * \brief SRSS Core Registers (ver3) (SRSS)
  */
typedef struct {
   __IM uint32_t RESERVED[16];
   __IM uint32_t PWR_LVD_STATUS;                /*!< 0x00000040 High Voltage / Low Voltage Detector (HVLVD) Status Register */
   __IM uint32_t PWR_LVD_STATUS2;               /*!< 0x00000044 High Voltage / Low Voltage Detector (HVLVD) Status Register #2 */
   __IM uint32_t RESERVED1[46];
  __IOM uint32_t CLK_DSI_SELECT[16];            /*!< 0x00000100 Clock DSI Select Register */
  __IOM uint32_t CLK_OUTPUT_FAST;               /*!< 0x00000140 Fast Clock Output Select Register */
  __IOM uint32_t CLK_OUTPUT_SLOW;               /*!< 0x00000144 Slow Clock Output Select Register */
  __IOM uint32_t CLK_CAL_CNT1;                  /*!< 0x00000148 Clock Calibration Counter 1 */
   __IM uint32_t CLK_CAL_CNT2;                  /*!< 0x0000014C Clock Calibration Counter 2 */
   __IM uint32_t RESERVED2[44];
  __IOM uint32_t SRSS_INTR;                     /*!< 0x00000200 SRSS Interrupt Register */
  __IOM uint32_t SRSS_INTR_SET;                 /*!< 0x00000204 SRSS Interrupt Set Register */
  __IOM uint32_t SRSS_INTR_MASK;                /*!< 0x00000208 SRSS Interrupt Mask Register */
   __IM uint32_t SRSS_INTR_MASKED;              /*!< 0x0000020C SRSS Interrupt Masked Register */
   __IM uint32_t RESERVED3[892];
   __IM uint32_t PWR_CTL;                       /*!< 0x00001000 Power Mode Control */
  __IOM uint32_t PWR_CTL2;                      /*!< 0x00001004 Power Mode Control 2 */
  __IOM uint32_t PWR_HIBERNATE;                 /*!< 0x00001008 HIBERNATE Mode Register */
   __IM uint32_t RESERVED4;
  __IOM uint32_t PWR_BUCK_CTL;                  /*!< 0x00001010 Buck Control Register */
  __IOM uint32_t PWR_BUCK_CTL2;                 /*!< 0x00001014 Buck Control Register 2 */
  __IOM uint32_t PWR_SSV_CTL;                   /*!< 0x00001018 Supply Supervision Control Register */
   __IM uint32_t PWR_SSV_STATUS;                /*!< 0x0000101C Supply Supervision Status Register */
  __IOM uint32_t PWR_LVD_CTL;                   /*!< 0x00001020 High Voltage / Low Voltage Detector (HVLVD) Configuration
                                                                Register */
  __IOM uint32_t PWR_LVD_CTL2;                  /*!< 0x00001024 High Voltage / Low Voltage Detector (HVLVD) Configuration
                                                                Register #2 */
  __IOM uint32_t PWR_REGHC_CTL;                 /*!< 0x00001028 REGHC Control Register */
   __IM uint32_t PWR_REGHC_STATUS;              /*!< 0x0000102C REGHC Status Register */
  __IOM uint32_t PWR_REGHC_CTL2;                /*!< 0x00001030 REGHC Control Register 2 */
   __IM uint32_t RESERVED5;
  __IOM uint32_t PWR_REGHC_CTL4;                /*!< 0x00001038 REGHC Control Register 4 */
   __IM uint32_t RESERVED6;
  __IOM uint32_t PWR_HIB_DATA[16];              /*!< 0x00001040 HIBERNATE Data Register */
   __IM uint32_t RESERVED7[16];
  __IOM uint32_t PWR_PMIC_CTL;                  /*!< 0x000010C0 PMIC Control Register */
   __IM uint32_t PWR_PMIC_STATUS;               /*!< 0x000010C4 PMIC Status Register */
  __IOM uint32_t PWR_PMIC_CTL2;                 /*!< 0x000010C8 PMIC Control Register 2 */
   __IM uint32_t RESERVED8;
  __IOM uint32_t PWR_PMIC_CTL4;                 /*!< 0x000010D0 PMIC Control Register 4 */
   __IM uint32_t RESERVED9[75];
  __IOM uint32_t CLK_PATH_SELECT[16];           /*!< 0x00001200 Clock Path Select Register */
  __IOM uint32_t CLK_ROOT_SELECT[16];           /*!< 0x00001240 Clock Root Select Register */
   __IM uint32_t RESERVED10[96];
        CSV_HF_Type CSV_HF;                     /*!< 0x00001400 Clock Supervisor (CSV) registers for Root clocks */
  __IOM uint32_t CLK_SELECT;                    /*!< 0x00001500 Clock selection register */
  __IOM uint32_t CLK_TIMER_CTL;                 /*!< 0x00001504 Timer Clock Control Register */
  __IOM uint32_t CLK_ILO0_CONFIG;               /*!< 0x00001508 ILO0 Configuration */
  __IOM uint32_t CLK_ILO1_CONFIG;               /*!< 0x0000150C ILO1 Configuration */
   __IM uint32_t RESERVED11[2];
  __IOM uint32_t CLK_IMO_CONFIG;                /*!< 0x00001518 IMO Configuration */
  __IOM uint32_t CLK_ECO_CONFIG;                /*!< 0x0000151C ECO Configuration Register */
  __IOM uint32_t CLK_ECO_PRESCALE;              /*!< 0x00001520 ECO Prescaler Configuration Register */
   __IM uint32_t CLK_ECO_STATUS;                /*!< 0x00001524 ECO Status Register */
  __IOM uint32_t CLK_PILO_CONFIG;               /*!< 0x00001528 Precision ILO Configuration Register */
   __IM uint32_t RESERVED12;
  __IOM uint32_t CLK_FLL_CONFIG;                /*!< 0x00001530 FLL Configuration Register */
  __IOM uint32_t CLK_FLL_CONFIG2;               /*!< 0x00001534 FLL Configuration Register 2 */
  __IOM uint32_t CLK_FLL_CONFIG3;               /*!< 0x00001538 FLL Configuration Register 3 */
  __IOM uint32_t CLK_FLL_CONFIG4;               /*!< 0x0000153C FLL Configuration Register 4 */
  __IOM uint32_t CLK_FLL_STATUS;                /*!< 0x00001540 FLL Status Register */
  __IOM uint32_t CLK_ECO_CONFIG2;               /*!< 0x00001544 ECO Configuration Register 2 */
   __IM uint32_t RESERVED13[46];
  __IOM uint32_t CLK_PLL_CONFIG[15];            /*!< 0x00001600 PLL Configuration Register */
   __IM uint32_t RESERVED14;
  __IOM uint32_t CLK_PLL_STATUS[15];            /*!< 0x00001640 PLL Status Register */
   __IM uint32_t RESERVED15[33];
  __IOM uint32_t CSV_REF_SEL;                   /*!< 0x00001700 Select CSV Reference clock for Active domain */
   __IM uint32_t RESERVED16[3];
        CSV_REF_Type CSV_REF;                   /*!< 0x00001710 CSV registers for the CSV Reference clock */
        CSV_LF_Type CSV_LF;                     /*!< 0x00001720 CSV registers for LF clock */
        CSV_ILO_Type CSV_ILO;                   /*!< 0x00001730 CSV registers for HVILO clock */
   __IM uint32_t RESERVED17[48];
  __IOM uint32_t RES_CAUSE;                     /*!< 0x00001800 Reset Cause Observation Register */
  __IOM uint32_t RES_CAUSE2;                    /*!< 0x00001804 Reset Cause Observation Register 2 */
   __IM uint32_t RESERVED18[62];
        CLK_PLL400M_Type CLK_PLL400M[15];       /*!< 0x00001900 400MHz PLL Configuration Register */
   __IM uint32_t RESERVED19[1417];
  __IOM uint32_t CLK_TRIM_ILO0_CTL;             /*!< 0x00003014 ILO0 Trim Register */
   __IM uint32_t RESERVED20[60];
  __IOM uint32_t PWR_TRIM_PWRSYS_CTL;           /*!< 0x00003108 Power System Trim Register */
   __IM uint32_t RESERVED21[2];
  __IOM uint32_t CLK_TRIM_PILO_CTL;             /*!< 0x00003114 PILO Trim Register */
  __IOM uint32_t CLK_TRIM_PILO_CTL2;            /*!< 0x00003118 PILO Trim Register 2 */
  __IOM uint32_t CLK_TRIM_PILO_CTL3;            /*!< 0x0000311C PILO Trim Register 3 */
   __IM uint32_t RESERVED22[64];
  __IOM uint32_t CLK_TRIM_ILO1_CTL;             /*!< 0x00003220 ILO1 Trim Register */
   __IM uint32_t RESERVED23[4983];
        MCWDT_Type MCWDT[4];                    /*!< 0x00008000 Multi-Counter Watchdog Timer */
   __IM uint32_t RESERVED24[3840];
        WDT_Type WDT_STRUCT;                    /*!< 0x0000C000 Watchdog Timer */
} SRSS_Type;                                    /*!< Size = 49280 (0xC080) */


/* CSV_HF_CSV.REF_CTL */
#define CSV_HF_CSV_REF_CTL_STARTUP_Pos          0UL
#define CSV_HF_CSV_REF_CTL_STARTUP_Msk          0xFFFFUL
#define CSV_HF_CSV_REF_CTL_CSV_ACTION_Pos       30UL
#define CSV_HF_CSV_REF_CTL_CSV_ACTION_Msk       0x40000000UL
#define CSV_HF_CSV_REF_CTL_CSV_EN_Pos           31UL
#define CSV_HF_CSV_REF_CTL_CSV_EN_Msk           0x80000000UL
/* CSV_HF_CSV.REF_LIMIT */
#define CSV_HF_CSV_REF_LIMIT_LOWER_Pos          0UL
#define CSV_HF_CSV_REF_LIMIT_LOWER_Msk          0xFFFFUL
#define CSV_HF_CSV_REF_LIMIT_UPPER_Pos          16UL
#define CSV_HF_CSV_REF_LIMIT_UPPER_Msk          0xFFFF0000UL
/* CSV_HF_CSV.MON_CTL */
#define CSV_HF_CSV_MON_CTL_PERIOD_Pos           0UL
#define CSV_HF_CSV_MON_CTL_PERIOD_Msk           0xFFFFUL


/* CSV_REF_CSV.REF_CTL */
#define CSV_REF_CSV_REF_CTL_STARTUP_Pos         0UL
#define CSV_REF_CSV_REF_CTL_STARTUP_Msk         0xFFFFUL
#define CSV_REF_CSV_REF_CTL_CSV_ACTION_Pos      30UL
#define CSV_REF_CSV_REF_CTL_CSV_ACTION_Msk      0x40000000UL
#define CSV_REF_CSV_REF_CTL_CSV_EN_Pos          31UL
#define CSV_REF_CSV_REF_CTL_CSV_EN_Msk          0x80000000UL
/* CSV_REF_CSV.REF_LIMIT */
#define CSV_REF_CSV_REF_LIMIT_LOWER_Pos         0UL
#define CSV_REF_CSV_REF_LIMIT_LOWER_Msk         0xFFFFUL
#define CSV_REF_CSV_REF_LIMIT_UPPER_Pos         16UL
#define CSV_REF_CSV_REF_LIMIT_UPPER_Msk         0xFFFF0000UL
/* CSV_REF_CSV.MON_CTL */
#define CSV_REF_CSV_MON_CTL_PERIOD_Pos          0UL
#define CSV_REF_CSV_MON_CTL_PERIOD_Msk          0xFFFFUL


/* CSV_LF_CSV.REF_CTL */
#define CSV_LF_CSV_REF_CTL_STARTUP_Pos          0UL
#define CSV_LF_CSV_REF_CTL_STARTUP_Msk          0xFFUL
#define CSV_LF_CSV_REF_CTL_CSV_EN_Pos           31UL
#define CSV_LF_CSV_REF_CTL_CSV_EN_Msk           0x80000000UL
/* CSV_LF_CSV.REF_LIMIT */
#define CSV_LF_CSV_REF_LIMIT_LOWER_Pos          0UL
#define CSV_LF_CSV_REF_LIMIT_LOWER_Msk          0xFFUL
#define CSV_LF_CSV_REF_LIMIT_UPPER_Pos          16UL
#define CSV_LF_CSV_REF_LIMIT_UPPER_Msk          0xFF0000UL
/* CSV_LF_CSV.MON_CTL */
#define CSV_LF_CSV_MON_CTL_PERIOD_Pos           0UL
#define CSV_LF_CSV_MON_CTL_PERIOD_Msk           0xFFUL


/* CSV_ILO_CSV.REF_CTL */
#define CSV_ILO_CSV_REF_CTL_STARTUP_Pos         0UL
#define CSV_ILO_CSV_REF_CTL_STARTUP_Msk         0xFFUL
#define CSV_ILO_CSV_REF_CTL_CSV_EN_Pos          31UL
#define CSV_ILO_CSV_REF_CTL_CSV_EN_Msk          0x80000000UL
/* CSV_ILO_CSV.REF_LIMIT */
#define CSV_ILO_CSV_REF_LIMIT_LOWER_Pos         0UL
#define CSV_ILO_CSV_REF_LIMIT_LOWER_Msk         0xFFUL
#define CSV_ILO_CSV_REF_LIMIT_UPPER_Pos         16UL
#define CSV_ILO_CSV_REF_LIMIT_UPPER_Msk         0xFF0000UL
/* CSV_ILO_CSV.MON_CTL */
#define CSV_ILO_CSV_MON_CTL_PERIOD_Pos          0UL
#define CSV_ILO_CSV_MON_CTL_PERIOD_Msk          0xFFUL


/* CLK_PLL400M.CONFIG */
#define CLK_PLL400M_CONFIG_FEEDBACK_DIV_Pos     0UL
#define CLK_PLL400M_CONFIG_FEEDBACK_DIV_Msk     0xFFUL
#define CLK_PLL400M_CONFIG_REFERENCE_DIV_Pos    8UL
#define CLK_PLL400M_CONFIG_REFERENCE_DIV_Msk    0x1F00UL
#define CLK_PLL400M_CONFIG_OUTPUT_DIV_Pos       16UL
#define CLK_PLL400M_CONFIG_OUTPUT_DIV_Msk       0x1F0000UL
#define CLK_PLL400M_CONFIG_LOCK_DELAY_Pos       25UL
#define CLK_PLL400M_CONFIG_LOCK_DELAY_Msk       0x6000000UL
#define CLK_PLL400M_CONFIG_BYPASS_SEL_Pos       28UL
#define CLK_PLL400M_CONFIG_BYPASS_SEL_Msk       0x30000000UL
#define CLK_PLL400M_CONFIG_ENABLE_Pos           31UL
#define CLK_PLL400M_CONFIG_ENABLE_Msk           0x80000000UL
/* CLK_PLL400M.CONFIG2 */
#define CLK_PLL400M_CONFIG2_FRAC_DIV_Pos        0UL
#define CLK_PLL400M_CONFIG2_FRAC_DIV_Msk        0xFFFFFFUL
#define CLK_PLL400M_CONFIG2_FRAC_DITHER_EN_Pos  28UL
#define CLK_PLL400M_CONFIG2_FRAC_DITHER_EN_Msk  0x70000000UL
#define CLK_PLL400M_CONFIG2_FRAC_EN_Pos         31UL
#define CLK_PLL400M_CONFIG2_FRAC_EN_Msk         0x80000000UL
/* CLK_PLL400M.CONFIG3 */
#define CLK_PLL400M_CONFIG3_SSCG_DEPTH_Pos      0UL
#define CLK_PLL400M_CONFIG3_SSCG_DEPTH_Msk      0x3FFUL
#define CLK_PLL400M_CONFIG3_SSCG_RATE_Pos       16UL
#define CLK_PLL400M_CONFIG3_SSCG_RATE_Msk       0x70000UL
#define CLK_PLL400M_CONFIG3_SSCG_DITHER_EN_Pos  24UL
#define CLK_PLL400M_CONFIG3_SSCG_DITHER_EN_Msk  0x1000000UL
#define CLK_PLL400M_CONFIG3_SSCG_MODE_Pos       28UL
#define CLK_PLL400M_CONFIG3_SSCG_MODE_Msk       0x10000000UL
#define CLK_PLL400M_CONFIG3_SSCG_EN_Pos         31UL
#define CLK_PLL400M_CONFIG3_SSCG_EN_Msk         0x80000000UL
/* CLK_PLL400M.STATUS */
#define CLK_PLL400M_STATUS_LOCKED_Pos           0UL
#define CLK_PLL400M_STATUS_LOCKED_Msk           0x1UL
#define CLK_PLL400M_STATUS_UNLOCK_OCCURRED_Pos  1UL
#define CLK_PLL400M_STATUS_UNLOCK_OCCURRED_Msk  0x2UL


