RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/include/ip/cyip_srss_v3.h
/* MCWDT_CTR.CTL */
#define MCWDT_CTR_CTL_ENABLED_Pos               0UL
#define MCWDT_CTR_CTL_ENABLED_Msk               0x1UL
#define MCWDT_CTR_CTL_ENABLE_Pos                31UL
#define MCWDT_CTR_CTL_ENABLE_Msk                0x80000000UL
/* MCWDT_CTR.LOWER_LIMIT */
#define MCWDT_CTR_LOWER_LIMIT_LOWER_LIMIT_Pos   0UL
#define MCWDT_CTR_LOWER_LIMIT_LOWER_LIMIT_Msk   0xFFFFUL
/* MCWDT_CTR.UPPER_LIMIT */
#define MCWDT_CTR_UPPER_LIMIT_UPPER_LIMIT_Pos   0UL
#define MCWDT_CTR_UPPER_LIMIT_UPPER_LIMIT_Msk   0xFFFFUL
/* MCWDT_CTR.WARN_LIMIT */
#define MCWDT_CTR_WARN_LIMIT_WARN_LIMIT_Pos     0UL
#define MCWDT_CTR_WARN_LIMIT_WARN_LIMIT_Msk     0xFFFFUL
/* MCWDT_CTR.CONFIG */
#define MCWDT_CTR_CONFIG_LOWER_ACTION_Pos       0UL
#define MCWDT_CTR_CONFIG_LOWER_ACTION_Msk       0x3UL
#define MCWDT_CTR_CONFIG_UPPER_ACTION_Pos       4UL
#define MCWDT_CTR_CONFIG_UPPER_ACTION_Msk       0x30UL
#define MCWDT_CTR_CONFIG_WARN_ACTION_Pos        8UL
#define MCWDT_CTR_CONFIG_WARN_ACTION_Msk        0x100UL
#define MCWDT_CTR_CONFIG_AUTO_SERVICE_Pos       12UL
#define MCWDT_CTR_CONFIG_AUTO_SERVICE_Msk       0x1000UL
#define MCWDT_CTR_CONFIG_DEBUG_TRIGGER_EN_Pos   28UL
#define MCWDT_CTR_CONFIG_DEBUG_TRIGGER_EN_Msk   0x10000000UL
#define MCWDT_CTR_CONFIG_SLEEPDEEP_PAUSE_Pos    30UL
#define MCWDT_CTR_CONFIG_SLEEPDEEP_PAUSE_Msk    0x40000000UL
#define MCWDT_CTR_CONFIG_DEBUG_RUN_Pos          31UL
#define MCWDT_CTR_CONFIG_DEBUG_RUN_Msk          0x80000000UL
/* MCWDT_CTR.CNT */
#define MCWDT_CTR_CNT_CNT_Pos                   0UL
#define MCWDT_CTR_CNT_CNT_Msk                   0xFFFFUL


/* MCWDT.CPU_SELECT */
#define MCWDT_CPU_SELECT_CPU_SEL_Pos            0UL
#define MCWDT_CPU_SELECT_CPU_SEL_Msk            0x3UL
/* MCWDT.CTR2_CTL */
#define MCWDT_CTR2_CTL_ENABLED_Pos              0UL
#define MCWDT_CTR2_CTL_ENABLED_Msk              0x1UL
#define MCWDT_CTR2_CTL_ENABLE_Pos               31UL
#define MCWDT_CTR2_CTL_ENABLE_Msk               0x80000000UL
/* MCWDT.CTR2_CONFIG */
#define MCWDT_CTR2_CONFIG_ACTION_Pos            0UL
#define MCWDT_CTR2_CONFIG_ACTION_Msk            0x1UL
#define MCWDT_CTR2_CONFIG_BITS_Pos              16UL
#define MCWDT_CTR2_CONFIG_BITS_Msk              0x1F0000UL
#define MCWDT_CTR2_CONFIG_DEBUG_TRIGGER_EN_Pos  28UL
#define MCWDT_CTR2_CONFIG_DEBUG_TRIGGER_EN_Msk  0x10000000UL
#define MCWDT_CTR2_CONFIG_SLEEPDEEP_PAUSE_Pos   30UL
#define MCWDT_CTR2_CONFIG_SLEEPDEEP_PAUSE_Msk   0x40000000UL
#define MCWDT_CTR2_CONFIG_DEBUG_RUN_Pos         31UL
#define MCWDT_CTR2_CONFIG_DEBUG_RUN_Msk         0x80000000UL
/* MCWDT.CTR2_CNT */
#define MCWDT_CTR2_CNT_CNT2_Pos                 0UL
#define MCWDT_CTR2_CNT_CNT2_Msk                 0xFFFFFFFFUL
/* MCWDT.LOCK */
#define MCWDT_LOCK_MCWDT_LOCK_Pos               0UL
#define MCWDT_LOCK_MCWDT_LOCK_Msk               0x3UL
/* MCWDT.SERVICE */
#define MCWDT_SERVICE_CTR0_SERVICE_Pos          0UL
#define MCWDT_SERVICE_CTR0_SERVICE_Msk          0x1UL
#define MCWDT_SERVICE_CTR1_SERVICE_Pos          1UL
#define MCWDT_SERVICE_CTR1_SERVICE_Msk          0x2UL
/* MCWDT.INTR */
#define MCWDT_INTR_CTR0_INT_Pos                 0UL
#define MCWDT_INTR_CTR0_INT_Msk                 0x1UL
#define MCWDT_INTR_CTR1_INT_Pos                 1UL
#define MCWDT_INTR_CTR1_INT_Msk                 0x2UL
#define MCWDT_INTR_CTR2_INT_Pos                 2UL
#define MCWDT_INTR_CTR2_INT_Msk                 0x4UL
/* MCWDT.INTR_SET */
#define MCWDT_INTR_SET_CTR0_INT_Pos             0UL
#define MCWDT_INTR_SET_CTR0_INT_Msk             0x1UL
#define MCWDT_INTR_SET_CTR1_INT_Pos             1UL
#define MCWDT_INTR_SET_CTR1_INT_Msk             0x2UL
#define MCWDT_INTR_SET_CTR2_INT_Pos             2UL
#define MCWDT_INTR_SET_CTR2_INT_Msk             0x4UL
/* MCWDT.INTR_MASK */
#define MCWDT_INTR_MASK_CTR0_INT_Pos            0UL
#define MCWDT_INTR_MASK_CTR0_INT_Msk            0x1UL
#define MCWDT_INTR_MASK_CTR1_INT_Pos            1UL
#define MCWDT_INTR_MASK_CTR1_INT_Msk            0x2UL
#define MCWDT_INTR_MASK_CTR2_INT_Pos            2UL
#define MCWDT_INTR_MASK_CTR2_INT_Msk            0x4UL
/* MCWDT.INTR_MASKED */
#define MCWDT_INTR_MASKED_CTR0_INT_Pos          0UL
#define MCWDT_INTR_MASKED_CTR0_INT_Msk          0x1UL
#define MCWDT_INTR_MASKED_CTR1_INT_Pos          1UL
#define MCWDT_INTR_MASKED_CTR1_INT_Msk          0x2UL
#define MCWDT_INTR_MASKED_CTR2_INT_Pos          2UL
#define MCWDT_INTR_MASKED_CTR2_INT_Msk          0x4UL


/* WDT.CTL */
#define WDT_CTL_ENABLED_Pos                     0UL
#define WDT_CTL_ENABLED_Msk                     0x1UL
#define WDT_CTL_ENABLE_Pos                      31UL
#define WDT_CTL_ENABLE_Msk                      0x80000000UL
/* WDT.LOWER_LIMIT */
#define WDT_LOWER_LIMIT_LOWER_LIMIT_Pos         0UL
#define WDT_LOWER_LIMIT_LOWER_LIMIT_Msk         0xFFFFFFFFUL
/* WDT.UPPER_LIMIT */
#define WDT_UPPER_LIMIT_UPPER_LIMIT_Pos         0UL
#define WDT_UPPER_LIMIT_UPPER_LIMIT_Msk         0xFFFFFFFFUL
/* WDT.WARN_LIMIT */
#define WDT_WARN_LIMIT_WARN_LIMIT_Pos           0UL
#define WDT_WARN_LIMIT_WARN_LIMIT_Msk           0xFFFFFFFFUL
/* WDT.CONFIG */
#define WDT_CONFIG_LOWER_ACTION_Pos             0UL
#define WDT_CONFIG_LOWER_ACTION_Msk             0x1UL
#define WDT_CONFIG_UPPER_ACTION_Pos             4UL
#define WDT_CONFIG_UPPER_ACTION_Msk             0x10UL
#define WDT_CONFIG_WARN_ACTION_Pos              8UL
#define WDT_CONFIG_WARN_ACTION_Msk              0x100UL
#define WDT_CONFIG_AUTO_SERVICE_Pos             12UL
#define WDT_CONFIG_AUTO_SERVICE_Msk             0x1000UL
#define WDT_CONFIG_DEBUG_TRIGGER_EN_Pos         28UL
#define WDT_CONFIG_DEBUG_TRIGGER_EN_Msk         0x10000000UL
#define WDT_CONFIG_DPSLP_PAUSE_Pos              29UL
#define WDT_CONFIG_DPSLP_PAUSE_Msk              0x20000000UL
#define WDT_CONFIG_HIB_PAUSE_Pos                30UL
#define WDT_CONFIG_HIB_PAUSE_Msk                0x40000000UL
#define WDT_CONFIG_DEBUG_RUN_Pos                31UL
#define WDT_CONFIG_DEBUG_RUN_Msk                0x80000000UL
/* WDT.CNT */
#define WDT_CNT_CNT_Pos                         0UL
#define WDT_CNT_CNT_Msk                         0xFFFFFFFFUL
/* WDT.LOCK */
#define WDT_LOCK_WDT_LOCK_Pos                   0UL
#define WDT_LOCK_WDT_LOCK_Msk                   0x3UL
/* WDT.SERVICE */
#define WDT_SERVICE_SERVICE_Pos                 0UL
#define WDT_SERVICE_SERVICE_Msk                 0x1UL
/* WDT.INTR */
#define WDT_INTR_WDT_Pos                        0UL
#define WDT_INTR_WDT_Msk                        0x1UL
/* WDT.INTR_SET */
#define WDT_INTR_SET_WDT_Pos                    0UL
#define WDT_INTR_SET_WDT_Msk                    0x1UL
/* WDT.INTR_MASK */
#define WDT_INTR_MASK_WDT_Pos                   0UL
#define WDT_INTR_MASK_WDT_Msk                   0x1UL
/* WDT.INTR_MASKED */
#define WDT_INTR_MASKED_WDT_Pos                 0UL
#define WDT_INTR_MASKED_WDT_Msk                 0x1UL


