RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/include/ip/cyip_srss_v3.h
#define SRSS_RES_CAUSE_RESET_SOFT_Msk           0x10UL
#define SRSS_RES_CAUSE_RESET_MCWDT0_Pos         5UL
#define SRSS_RES_CAUSE_RESET_MCWDT0_Msk         0x20UL
#define SRSS_RES_CAUSE_RESET_MCWDT1_Pos         6UL
#define SRSS_RES_CAUSE_RESET_MCWDT1_Msk         0x40UL
#define SRSS_RES_CAUSE_RESET_MCWDT2_Pos         7UL
#define SRSS_RES_CAUSE_RESET_MCWDT2_Msk         0x80UL
#define SRSS_RES_CAUSE_RESET_MCWDT3_Pos         8UL
#define SRSS_RES_CAUSE_RESET_MCWDT3_Msk         0x100UL
#define SRSS_RES_CAUSE_RESET_XRES_Pos           16UL
#define SRSS_RES_CAUSE_RESET_XRES_Msk           0x10000UL
#define SRSS_RES_CAUSE_RESET_BODVDDD_Pos        17UL
#define SRSS_RES_CAUSE_RESET_BODVDDD_Msk        0x20000UL
#define SRSS_RES_CAUSE_RESET_BODVDDA_Pos        18UL
#define SRSS_RES_CAUSE_RESET_BODVDDA_Msk        0x40000UL
#define SRSS_RES_CAUSE_RESET_BODVCCD_Pos        19UL
#define SRSS_RES_CAUSE_RESET_BODVCCD_Msk        0x80000UL
#define SRSS_RES_CAUSE_RESET_OVDVDDD_Pos        20UL
#define SRSS_RES_CAUSE_RESET_OVDVDDD_Msk        0x100000UL
#define SRSS_RES_CAUSE_RESET_OVDVDDA_Pos        21UL
#define SRSS_RES_CAUSE_RESET_OVDVDDA_Msk        0x200000UL
#define SRSS_RES_CAUSE_RESET_OVDVCCD_Pos        22UL
#define SRSS_RES_CAUSE_RESET_OVDVCCD_Msk        0x400000UL
#define SRSS_RES_CAUSE_RESET_OCD_ACT_LINREG_Pos 23UL
#define SRSS_RES_CAUSE_RESET_OCD_ACT_LINREG_Msk 0x800000UL
#define SRSS_RES_CAUSE_RESET_OCD_DPSLP_LINREG_Pos 24UL
#define SRSS_RES_CAUSE_RESET_OCD_DPSLP_LINREG_Msk 0x1000000UL
#define SRSS_RES_CAUSE_RESET_OCD_REGHC_Pos      25UL
#define SRSS_RES_CAUSE_RESET_OCD_REGHC_Msk      0x2000000UL
#define SRSS_RES_CAUSE_RESET_PMIC_Pos           26UL
#define SRSS_RES_CAUSE_RESET_PMIC_Msk           0x4000000UL
#define SRSS_RES_CAUSE_RESET_PXRES_Pos          28UL
#define SRSS_RES_CAUSE_RESET_PXRES_Msk          0x10000000UL
#define SRSS_RES_CAUSE_RESET_STRUCT_XRES_Pos    29UL
#define SRSS_RES_CAUSE_RESET_STRUCT_XRES_Msk    0x20000000UL
#define SRSS_RES_CAUSE_RESET_PORVDDD_Pos        30UL
#define SRSS_RES_CAUSE_RESET_PORVDDD_Msk        0x40000000UL
/* SRSS.RES_CAUSE2 */
#define SRSS_RES_CAUSE2_RESET_CSV_HF_Pos        0UL
#define SRSS_RES_CAUSE2_RESET_CSV_HF_Msk        0xFFFFUL
#define SRSS_RES_CAUSE2_RESET_CSV_REF_Pos       16UL
#define SRSS_RES_CAUSE2_RESET_CSV_REF_Msk       0x10000UL
/* SRSS.CLK_TRIM_ILO0_CTL */
#define SRSS_CLK_TRIM_ILO0_CTL_ILO0_FTRIM_Pos   0UL
#define SRSS_CLK_TRIM_ILO0_CTL_ILO0_FTRIM_Msk   0x3FUL
#define SRSS_CLK_TRIM_ILO0_CTL_ILO0_MONTRIM_Pos 8UL
#define SRSS_CLK_TRIM_ILO0_CTL_ILO0_MONTRIM_Msk 0xF00UL
/* SRSS.PWR_TRIM_PWRSYS_CTL */
#define SRSS_PWR_TRIM_PWRSYS_CTL_ACT_REG_TRIM_Pos 0UL
#define SRSS_PWR_TRIM_PWRSYS_CTL_ACT_REG_TRIM_Msk 0x1FUL
#define SRSS_PWR_TRIM_PWRSYS_CTL_ACT_REG_BOOST_Pos 30UL
#define SRSS_PWR_TRIM_PWRSYS_CTL_ACT_REG_BOOST_Msk 0xC0000000UL
/* SRSS.CLK_TRIM_PILO_CTL */
#define SRSS_CLK_TRIM_PILO_CTL_PILO_CFREQ_Pos   0UL
#define SRSS_CLK_TRIM_PILO_CTL_PILO_CFREQ_Msk   0x3FUL
#define SRSS_CLK_TRIM_PILO_CTL_PILO_OSC_TRIM_Pos 12UL
#define SRSS_CLK_TRIM_PILO_CTL_PILO_OSC_TRIM_Msk 0x7000UL
#define SRSS_CLK_TRIM_PILO_CTL_PILO_COMP_TRIM_Pos 16UL
#define SRSS_CLK_TRIM_PILO_CTL_PILO_COMP_TRIM_Msk 0x30000UL
#define SRSS_CLK_TRIM_PILO_CTL_PILO_NBIAS_TRIM_Pos 18UL
#define SRSS_CLK_TRIM_PILO_CTL_PILO_NBIAS_TRIM_Msk 0xC0000UL
#define SRSS_CLK_TRIM_PILO_CTL_PILO_RES_TRIM_Pos 20UL
#define SRSS_CLK_TRIM_PILO_CTL_PILO_RES_TRIM_Msk 0x1F00000UL
#define SRSS_CLK_TRIM_PILO_CTL_PILO_ISLOPE_TRIM_Pos 26UL
#define SRSS_CLK_TRIM_PILO_CTL_PILO_ISLOPE_TRIM_Msk 0xC000000UL
#define SRSS_CLK_TRIM_PILO_CTL_PILO_VTDIFF_TRIM_Pos 28UL
#define SRSS_CLK_TRIM_PILO_CTL_PILO_VTDIFF_TRIM_Msk 0x70000000UL
/* SRSS.CLK_TRIM_PILO_CTL2 */
#define SRSS_CLK_TRIM_PILO_CTL2_PILO_VREF_TRIM_Pos 0UL
#define SRSS_CLK_TRIM_PILO_CTL2_PILO_VREF_TRIM_Msk 0xFFUL
#define SRSS_CLK_TRIM_PILO_CTL2_PILO_IREFBM_TRIM_Pos 8UL
#define SRSS_CLK_TRIM_PILO_CTL2_PILO_IREFBM_TRIM_Msk 0x1F00UL
#define SRSS_CLK_TRIM_PILO_CTL2_PILO_IREF_TRIM_Pos 16UL
#define SRSS_CLK_TRIM_PILO_CTL2_PILO_IREF_TRIM_Msk 0xFF0000UL
/* SRSS.CLK_TRIM_PILO_CTL3 */
#define SRSS_CLK_TRIM_PILO_CTL3_PILO_ENGOPT_Pos 0UL
#define SRSS_CLK_TRIM_PILO_CTL3_PILO_ENGOPT_Msk 0xFFFFUL
/* SRSS.CLK_TRIM_ILO1_CTL */
#define SRSS_CLK_TRIM_ILO1_CTL_ILO1_FTRIM_Pos   0UL
#define SRSS_CLK_TRIM_ILO1_CTL_ILO1_FTRIM_Msk   0x3FUL
#define SRSS_CLK_TRIM_ILO1_CTL_ILO1_MONTRIM_Pos 8UL
#define SRSS_CLK_TRIM_ILO1_CTL_ILO1_MONTRIM_Msk 0xF00UL


#endif /* _CYIP_SRSS_V3_H_ */


/* [] END OF FILE */
